{
/* Validity statuses */
GPGUnknownString = "Ukendt";
GPGValidityUndefinedString = "Udefineret";
GPGValidityNeverString = "Aldrig";
GPGValidityMarginalString = "Marginal";
GPGValidityFullString = "Fuldstændig";
GPGValidityUltimateString = "Ultimativ";

/* Hash algorithms */
"MD5" = "MD5";
"SHA1" = "SHA1";
"RIPE MD160" = "RIPE MD160";
"Double Width SHA" = "Double Width SHA";
"MD2" = "MD2";
"TIGER192" = "TIGER192";
"HAVAL" = "HAVAL";

/* Public key algorithms */
"RSA" = "RSA";
"RSA Encrypt" = "RSA-kryptering";
"RSA Sign" = "RSA-signatur";
"ElGamal Encrypt" = "ElGamal Kryptering";
"DSA" = "DSA";
"Elliptic Curve" = "Elliptic Curve";
"ECDSA" = "ECDSA";
"ElGamal" = "ElGamal";
"DH" = "DH";

/* Symmetric key algorithms */
GPGNoAlgorithmString = "Ingen algoritme";
GPGIDEAAlgorithmString = "IDEA";
GPGTripleDESAlgorithmString = "3DES";
GPGCAST5AlgorithmString = "CAST5";
GPGBlowfishAlgorithmString = "Blowfish";
GPGSAFERSK128AlgorithmString = "SAFER SK128";
GPGDESSKAlgorithmString = "DES SK";
GPGAES128AlgorithmString = "AES 128";
GPGAES192AlgorithmString = "AES 192";
GPGAES256AlgorithmString = "AES 256";
GPGTwoFishAlgorithmString = "TwoFish 256";
GPGSkipjackAlgorithmString = "Skipjack";
GPGTwoFishOldAlgorithmString = "TwoFish 128";
GPGDummyAlgorithmString = "Dummy Algorithm";
}